app/controllers/polls_controller.rb

SELECT "polls".* FROM "polls"
---
    def index
        @polls = Poll.all.reverse

SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def show
        @poll = Poll.find(params[:id])

INSERT INTO "polls" ("created_at", "updated_at", "title", "author", "question", "totalvotes") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2017-11-08 02:05:41.913159"], ["updated_at", "2017-11-08 02:05:41.913159"], ["title", "First poll"], ["author", "Tyler"], ["question", "This is fun?"], ["totalvotes", 0]]
---
    def create
        @poll = Poll.new(poll_params)

        if @poll.save

SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "polls" WHERE "polls"."id" = ?  [["id", 1]]
---
    def destroy
        if !user_signed_in?
            return
        end
        @poll = Poll.find(params[:id])

        @poll.destroy