app/controllers/welcome_controller.rb

SELECT "polls".* FROM "polls"
---
  def index
    @featured_polls = Poll.all.sample(10)